tap 'caskroom/cask'
tap 'neovim/neovim'
tap 'caskroom/fonts'
tap 'thoughtbot/formulae'
cask 'font-hack-nerd-font'
cask 'font-inconsolata'
cask 'google-chrome'
cask 'vlc'
cask 'visual-studio-code'
cask 'virtualbox'
cask 'transmission'
cask 'postico'
cask 'hex-fiend'
cask 'xld'
cask 'handbrake'
cask 'handbrakebatch'
cask 'boxer'
cask 'slack'
cask 'sourcetree'
cask 'android-file-transfer'
cask 'itsycal'
cask 'omnidisksweeper'
cask 'insomniax'
cask 'iterm2'
cask 'java'           # Java Langauge
cask 'android-sdk'    # CLI adb Android SDK
cask 'pdftotext'      # CLI for converting PDF to Text. Used fir Ranger
cask 'wkhtmltopdf'    # CLI wkhtmltopdf Convert HTML to PDFs
brew 'mas'
brew 'ansible'        # CLI Ansible
brew 'autoconf'       # CLI Build utility
brew 'automake'       # CLI Build utility
brew 'awscli'         # CLI Amazon AWS CLI
brew 'cmake'          # CLI Build utility
brew 'coreutils'      # CLI GNU utilities
brew 'ctags'          # CLI Exhuburant ctags
brew 'diff-so-fancy'  # CLI diff-highlight for git
brew 'dfu-util'       # CLI Firmware loader for keyboard
brew 'dnsmasq'        # Service Local DNS. Used to route *.localhost
brew 'exercism'       # CLI exercism.io
brew 'fontconfig'     # CLI fontconfig Font utility for patching fonts
brew 'ffmpeg'         # CLI ffmpeg Media encoder/decoder
brew 'freetype'       # Library Render fonts
brew 'fzf'            # CLI Fuzzy Finder CLI
brew 'ghostscript'    # CLI Produce PDFs
brew 'git'            # CLI Git
brew 'hub'            # CLI add commands to git
brew 'git-flow'       # CLI Git-Flow git shortcuts
brew 'glib'           # Library Build utility
brew 'go'             # Go Language
brew 'htop-osx'       # CLI htop process utility
brew 'imagemagick'    # CLI magick Image converter CLI
brew 'lame'           # Library audio encoder/decoder
brew 'libxml2'        # Library XML parsing
brew 'mongodb'        # Service Database
brew 'mysql'          # Service Database
brew 'postgresql'     # Service Database
brew 'nginx'          # Service Web server
brew 'neovim'         # CLI text editor
brew 'openssl'        # Library SSL library
brew 'libyaml'        # Library for parsing YAML
brew 'p7zip'          # CLI 7a 7za compression
brew 'passenger'      # Library Ruby Web Server
brew 'phantomjs'      # CLI phantomjs headless webkit browser (for testing)
brew 'wget'           # CLI wget HTTP interface
brew 'qt@5.5'         # Library qt. Used for Capybara
brew 'ranger'         # CLI Ranger File Explorer
brew 'highlight'      # Library. Provides syntax highlighting. Used for Ranger
brew 'atool'          # CLI. Archives inspection. Used for Ranger.
brew 'transmission'   # CLI. Bittorrent tool. Used for Ranger.
brew 'mediainfo'      # CLI. Media file metadata inspection. Used for Ranger.
brew 'exiftool'       # CLI. Image file metadata inspection. Used for Ranger.
brew 'redis'          # Server Database
brew 'readline'       # Library file reading
brew 'ripgrep'        # CLI rg grep current directory
brew 'rsync'          # CLI rsync file copying
brew 'shellcheck'     # CLI POSIX shell linter
brew 'sqlite'         # Service Database
brew 'tesseract'      # CLI tesseract OCR
brew 'tidy-html5'     # CLI tidy HTML linting
brew 'tmate'          # CLI tmate tmux over SSH
brew 'tmux'           # CLI tmux terminal multiplexer
brew 'reattach-to-user-namespace' # CLI to help tmux
brew 'unrar'          # CLI unrar compression
brew 'xz'             # CLI xz compression
brew 'x264'           # Library video decoder
brew 'yarn'           # CLI JavaScript package manager
brew 'wrk'            # CLI wrk HTTP benchmarking
brew 'heroku'         # CLI heroku
brew 'parity'         # CLI adding commands to heroku
#mas 'Xcode',          id: 497799835
mas 'The Unarchiver', id: 425424353
mas 'Medis',          id: 1063631769
